_____________________________________________________________________________________________________________________________
Layer (type)                             Output Shape               Param #        Connected to                              
=============================================================================================================================
input_1 (InputLayer)                     (None, 14, 32, 32, 2)      0                                                        
_____________________________________________________________________________________________________________________________
time_distributed_1 (TimeDistributed)     (None, 14, 32, 32, 48)     864            input_1[0][0]                             
_____________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalizatio (None, 14, 32, 32, 48)     192            time_distributed_1[0][0]                  
_____________________________________________________________________________________________________________________________
activation_1 (Activation)                (None, 14, 32, 32, 48)     0              batch_normalization_1[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_2 (TimeDistributed)     (None, 14, 32, 32, 64)     27648          activation_1[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_1 (Dropout)                      (None, 14, 32, 32, 64)     0              time_distributed_2[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)              (None, 14, 32, 32, 112)    0              time_distributed_1[0][0]                  
                                                                                   dropout_1[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalizatio (None, 14, 32, 32, 112)    448            concatenate_1[0][0]                       
_____________________________________________________________________________________________________________________________
activation_2 (Activation)                (None, 14, 32, 32, 112)    0              batch_normalization_2[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_3 (TimeDistributed)     (None, 14, 32, 32, 64)     64512          activation_2[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_2 (Dropout)                      (None, 14, 32, 32, 64)     0              time_distributed_3[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)              (None, 14, 32, 32, 176)    0              time_distributed_1[0][0]                  
                                                                                   dropout_1[0][0]                           
                                                                                   dropout_2[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalizatio (None, 14, 32, 32, 176)    704            concatenate_2[0][0]                       
_____________________________________________________________________________________________________________________________
activation_3 (Activation)                (None, 14, 32, 32, 176)    0              batch_normalization_3[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_4 (TimeDistributed)     (None, 14, 32, 32, 176)    30976          activation_3[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_3 (Dropout)                      (None, 14, 32, 32, 176)    0              time_distributed_4[0][0]                  
_____________________________________________________________________________________________________________________________
time_distributed_5 (TimeDistributed)     (None, 14, 16, 16, 176)    0              dropout_3[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalizatio (None, 14, 16, 16, 176)    704            time_distributed_5[0][0]                  
_____________________________________________________________________________________________________________________________
activation_4 (Activation)                (None, 14, 16, 16, 176)    0              batch_normalization_4[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_6 (TimeDistributed)     (None, 14, 16, 16, 64)     101376         activation_4[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_4 (Dropout)                      (None, 14, 16, 16, 64)     0              time_distributed_6[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)              (None, 14, 16, 16, 240)    0              time_distributed_5[0][0]                  
                                                                                   dropout_4[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalizatio (None, 14, 16, 16, 240)    960            concatenate_3[0][0]                       
_____________________________________________________________________________________________________________________________
activation_5 (Activation)                (None, 14, 16, 16, 240)    0              batch_normalization_5[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_7 (TimeDistributed)     (None, 14, 16, 16, 64)     138240         activation_5[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_5 (Dropout)                      (None, 14, 16, 16, 64)     0              time_distributed_7[0][0]                  
_____________________________________________________________________________________________________________________________
concatenate_4 (Concatenate)              (None, 14, 16, 16, 304)    0              time_distributed_5[0][0]                  
                                                                                   dropout_4[0][0]                           
                                                                                   dropout_5[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalizatio (None, 14, 16, 16, 304)    1216           concatenate_4[0][0]                       
_____________________________________________________________________________________________________________________________
activation_6 (Activation)                (None, 14, 16, 16, 304)    0              batch_normalization_6[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_8 (TimeDistributed)     (None, 14, 16, 16, 304)    92416          activation_6[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_6 (Dropout)                      (None, 14, 16, 16, 304)    0              time_distributed_8[0][0]                  
_____________________________________________________________________________________________________________________________
time_distributed_9 (TimeDistributed)     (None, 14, 8, 8, 304)      0              dropout_6[0][0]                           
_____________________________________________________________________________________________________________________________
bidirectional_1 (Bidirectional)          (None, 14, 8, 8, 120)      1572480        time_distributed_9[0][0]                  
_____________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalizatio (None, 14, 8, 8, 120)      480            bidirectional_1[0][0]                     
_____________________________________________________________________________________________________________________________
activation_7 (Activation)                (None, 14, 8, 8, 120)      0              batch_normalization_7[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_10 (TimeDistributed)    (None, 14, 8, 8, 64)       69120          activation_7[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_7 (Dropout)                      (None, 14, 8, 8, 64)       0              time_distributed_10[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_5 (Concatenate)              (None, 14, 8, 8, 184)      0              bidirectional_1[0][0]                     
                                                                                   dropout_7[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalizatio (None, 14, 8, 8, 184)      736            concatenate_5[0][0]                       
_____________________________________________________________________________________________________________________________
activation_8 (Activation)                (None, 14, 8, 8, 184)      0              batch_normalization_8[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_11 (TimeDistributed)    (None, 14, 8, 8, 64)       105984         activation_8[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_8 (Dropout)                      (None, 14, 8, 8, 64)       0              time_distributed_11[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_7 (Concatenate)              (None, 14, 8, 8, 128)      0              dropout_7[0][0]                           
                                                                                   dropout_8[0][0]                           
_____________________________________________________________________________________________________________________________
time_distributed_12 (TimeDistributed)    (None, 14, 16, 16, 128)    147584         concatenate_7[0][0]                       
_____________________________________________________________________________________________________________________________
concatenate_8 (Concatenate)              (None, 14, 16, 16, 432)    0              time_distributed_12[0][0]                 
                                                                                   concatenate_4[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalizatio (None, 14, 16, 16, 432)    1728           concatenate_8[0][0]                       
_____________________________________________________________________________________________________________________________
activation_9 (Activation)                (None, 14, 16, 16, 432)    0              batch_normalization_9[0][0]               
_____________________________________________________________________________________________________________________________
time_distributed_13 (TimeDistributed)    (None, 14, 16, 16, 64)     248832         activation_9[0][0]                        
_____________________________________________________________________________________________________________________________
dropout_9 (Dropout)                      (None, 14, 16, 16, 64)     0              time_distributed_13[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_9 (Concatenate)              (None, 14, 16, 16, 496)    0              concatenate_8[0][0]                       
                                                                                   dropout_9[0][0]                           
_____________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalizati (None, 14, 16, 16, 496)    1984           concatenate_9[0][0]                       
_____________________________________________________________________________________________________________________________
activation_10 (Activation)               (None, 14, 16, 16, 496)    0              batch_normalization_10[0][0]              
_____________________________________________________________________________________________________________________________
time_distributed_14 (TimeDistributed)    (None, 14, 16, 16, 64)     285696         activation_10[0][0]                       
_____________________________________________________________________________________________________________________________
dropout_10 (Dropout)                     (None, 14, 16, 16, 64)     0              time_distributed_14[0][0]                 
_____________________________________________________________________________________________________________________________
concatenate_11 (Concatenate)             (None, 14, 16, 16, 128)    0              dropout_9[0][0]                           
                                                                                   dropout_10[0][0]                          
_____________________________________________________________________________________________________________________________
time_distributed_15 (TimeDistributed)    (None, 14, 32, 32, 128)    147584         concatenate_11[0][0]                      
_____________________________________________________________________________________________________________________________
concatenate_12 (Concatenate)             (None, 14, 32, 32, 304)    0              time_distributed_15[0][0]                 
                                                                                   concatenate_2[0][0]                       
_____________________________________________________________________________________________________________________________
time_distributed_18 (TimeDistributed)    (None, 14, 32, 32, 11)     3344           concatenate_12[0][0]                      
=============================================================================================================================
Total params: 3,045,808
Trainable params: 3,041,232
Non-trainable params: 4,576
_____________________________________________________________________________________________________________________________
