_____________________________________________________________________________________________________________________________
Layer (type)                             Output Shape               Param #        Connected to                              
=============================================================================================================================
input_1 (InputLayer)                     (None, 13, 32, 32, 3)      0                                                        
_____________________________________________________________________________________________________________________________
conv3d_1 (Conv3D)                        (None, 13, 32, 32, 16)     1312           input_1[0][0]                             
_____________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalizatio (None, 13, 32, 32, 16)     64             conv3d_1[0][0]                            
_____________________________________________________________________________________________________________________________
activation_1 (Activation)                (None, 13, 32, 32, 16)     0              batch_normalization_1[0][0]               
_____________________________________________________________________________________________________________________________
average_pooling3d_1 (AveragePooling3D)   (None, 13, 16, 16, 16)     0              activation_1[0][0]                        
_____________________________________________________________________________________________________________________________
conv3d_2 (Conv3D)                        (None, 13, 16, 16, 32)     13856          average_pooling3d_1[0][0]                 
_____________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalizatio (None, 13, 16, 16, 32)     128            conv3d_2[0][0]                            
_____________________________________________________________________________________________________________________________
activation_2 (Activation)                (None, 13, 16, 16, 32)     0              batch_normalization_2[0][0]               
_____________________________________________________________________________________________________________________________
average_pooling3d_2 (AveragePooling3D)   (None, 13, 8, 8, 32)       0              activation_2[0][0]                        
_____________________________________________________________________________________________________________________________
conv3d_3 (Conv3D)                        (None, 13, 8, 8, 64)       55360          average_pooling3d_2[0][0]                 
_____________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalizatio (None, 13, 8, 8, 64)       256            conv3d_3[0][0]                            
_____________________________________________________________________________________________________________________________
activation_3 (Activation)                (None, 13, 8, 8, 64)       0              batch_normalization_3[0][0]               
_____________________________________________________________________________________________________________________________
average_pooling3d_3 (AveragePooling3D)   (None, 13, 4, 4, 64)       0              activation_3[0][0]                        
_____________________________________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTranspose)     (None, 13, 8, 8, 64)       110656         average_pooling3d_3[0][0]                 
_____________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalizatio (None, 13, 8, 8, 64)       256            conv3d_transpose_1[0][0]                  
_____________________________________________________________________________________________________________________________
activation_4 (Activation)                (None, 13, 8, 8, 64)       0              batch_normalization_4[0][0]               
_____________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)              (None, 13, 8, 8, 128)      0              activation_4[0][0]                        
                                                                                   activation_3[0][0]                        
_____________________________________________________________________________________________________________________________
conv3d_4 (Conv3D)                        (None, 13, 8, 8, 64)       221248         concatenate_1[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalizatio (None, 13, 8, 8, 64)       256            conv3d_4[0][0]                            
_____________________________________________________________________________________________________________________________
activation_5 (Activation)                (None, 13, 8, 8, 64)       0              batch_normalization_5[0][0]               
_____________________________________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTranspose)     (None, 13, 16, 16, 32)     55328          activation_5[0][0]                        
_____________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalizatio (None, 13, 16, 16, 32)     128            conv3d_transpose_2[0][0]                  
_____________________________________________________________________________________________________________________________
activation_6 (Activation)                (None, 13, 16, 16, 32)     0              batch_normalization_6[0][0]               
_____________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)              (None, 13, 16, 16, 64)     0              activation_6[0][0]                        
                                                                                   activation_2[0][0]                        
_____________________________________________________________________________________________________________________________
conv3d_5 (Conv3D)                        (None, 13, 16, 16, 32)     55328          concatenate_2[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalizatio (None, 13, 16, 16, 32)     128            conv3d_5[0][0]                            
_____________________________________________________________________________________________________________________________
activation_7 (Activation)                (None, 13, 16, 16, 32)     0              batch_normalization_7[0][0]               
_____________________________________________________________________________________________________________________________
conv3d_transpose_3 (Conv3DTranspose)     (None, 13, 32, 32, 16)     13840          activation_7[0][0]                        
_____________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalizatio (None, 13, 32, 32, 16)     64             conv3d_transpose_3[0][0]                  
_____________________________________________________________________________________________________________________________
activation_8 (Activation)                (None, 13, 32, 32, 16)     0              batch_normalization_8[0][0]               
_____________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)              (None, 13, 32, 32, 32)     0              activation_8[0][0]                        
                                                                                   activation_1[0][0]                        
_____________________________________________________________________________________________________________________________
conv3d_6 (Conv3D)                        (None, 13, 32, 32, 16)     13840          concatenate_3[0][0]                       
_____________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalizatio (None, 13, 32, 32, 16)     64             conv3d_6[0][0]                            
_____________________________________________________________________________________________________________________________
activation_9 (Activation)                (None, 13, 32, 32, 16)     0              batch_normalization_9[0][0]               
_____________________________________________________________________________________________________________________________
conv3d_7 (Conv3D)                        (None, 13, 32, 32, 14)     238            activation_9[0][0]                        
=============================================================================================================================
Total params: 542,350
Trainable params: 541,678
Non-trainable params: 672
_____________________________________________________________________________________________________________________________
